Environment: prod. Pipeline Stage: prod
Plan has been truncated:
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-1"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-1"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-2"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-2"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-cloud-agent-test"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-cloud-agent-test"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-device-manager"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # azurerm_resource_group_template_deployment.cloud_agent_update_schedule["xwc-device-manager-test"] will be created
  + resource "azurerm_resource_group_template_deployment" "cloud_agent_update_schedule" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "xwc-device-manager-test"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
      + template_content    = (known after apply)
    }

  # time_offset.tomorrow will be created
  + resource "time_offset" "tomorrow" {
      + base_rfc3339 = (known after apply)
      + day          = (known after apply)
      + hour         = (known after apply)
      + id           = (known after apply)
      + minute       = (known after apply)
      + month        = (known after apply)
      + offset_days  = 1
      + rfc3339      = (known after apply)
      + second       = (known after apply)
      + unix         = (known after apply)
      + year         = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca02"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca03"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca04"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca05"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca06"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca07"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca08"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca09"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca10"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca11"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwcca12"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca01"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_backup_protected_vm.VM_VAULT["vmxwctestca02"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca01"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca01"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca01"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.4"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca02"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca02"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca02"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.7"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca03"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca03"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca03"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.10"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca04"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca04"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca04"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.13"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca05"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca05"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca05"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.16"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwcca06"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwcca06"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwcca06"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.19"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb.load_balancer["lbxwctestca01"] will be created
  + resource "azurerm_lb" "load_balancer" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "lbxwctestca01"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-xwc-core-001"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "fe-lbxwctestca01"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.192.30.132"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-test"
          + zones                                              = (known after apply)
        }
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca01"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca01"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca02"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca02"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca03"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca03"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca04"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca04"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca05"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca05"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwcca06"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwcca06"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool.backend_pool["lbxwctestca01"] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "be-lbxwctestca01"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca01"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.5"
      + name                    = "be-pool-ip-vmxwcca01"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca02"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.6"
      + name                    = "be-pool-ip-vmxwcca02"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca03"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.8"
      + name                    = "be-pool-ip-vmxwcca03"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca04"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.9"
      + name                    = "be-pool-ip-vmxwcca04"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca05"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.11"
      + name                    = "be-pool-ip-vmxwcca05"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca06"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.12"
      + name                    = "be-pool-ip-vmxwcca06"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca07"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.14"
      + name                    = "be-pool-ip-vmxwcca07"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca08"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.15"
      + name                    = "be-pool-ip-vmxwcca08"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca09"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.17"
      + name                    = "be-pool-ip-vmxwcca09"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca10"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.18"
      + name                    = "be-pool-ip-vmxwcca10"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca11"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.20"
      + name                    = "be-pool-ip-vmxwcca11"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwcca12"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.21"
      + name                    = "be-pool-ip-vmxwcca12"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca01"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.133"
      + name                    = "be-pool-ip-vmxwctestca01"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_backend_address_pool_address.backend_pool_ip["vmxwctestca02"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "backend_pool_ip" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_address              = "10.192.30.134"
      + name                    = "be-pool-ip-vmxwctestca02"
      + virtual_network_id      = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca01"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca01"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca02"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca02"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca03"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca03"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca04"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca04"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca05"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca05"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwcca06"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwcca06"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_probe.health_probe["lbxwctestca01"] will be created
  + resource "azurerm_lb_probe" "health_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "rule-3389-lbxwctestca01"
      + number_of_probes    = 2
      + port                = 3389
      + protocol            = (known after apply)
      + resource_group_name = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca01"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca01"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca01"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca02"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca02"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca02"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca03"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca03"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca03"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca04"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca04"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca04"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca05"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca05"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca05"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwcca06"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwcca06"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwcca06"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_lb_rule.loadbalancing_rule["lbxwctestca01"] will be created
  + resource "azurerm_lb_rule" "loadbalancing_rule" {
      + backend_address_pool_id        = (known after apply)
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 3389
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "fe-lbxwctestca01"
      + frontend_port                  = 3389
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = "SourceIPProtocol"
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-3389-lbxwctestca01"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + resource_group_name            = "rg-xwc-core-001"
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca01"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca01"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.5"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca02"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca02"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.6"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca03"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca03"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.8"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca04"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca04"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.9"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca05"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca05"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.11"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca06"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca06"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.12"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca07"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcca07"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-core-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.14"
          + private_ip_address_allocation                      = "static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.cloud-agent.azurerm_network_interface.NIC["vmxwcca08"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + inte